# JPerG Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..JPerG Property
SymbolTypeId Class See Also
---
Symbol J/g, indicating unit Joules per gram.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId JPerG { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JPerG As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JPerG {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace